{
  "name": "Abraham Perez",
  "introText": "I’m specilizing on web and mobile Front-End or Full Stack development. I'm currently looking for a remote job opportunity as Front-end or Full-stack developer!",
  "aboutMeText": [
    "Hello! My name is Abraham and I enjoy creating things that live on the internet. My interest in web development started back in 2018 when I was exposed to basic concepts of Web Development such as jQuery, HTML, and CSS on my Internet Programming class. I was amazed to know that I can create any interface only using a computer!",
    "Fast-forward to today, and I’ve had the privilege of having two internships at ExxonMobil, one as an Admin Analyst and the other one as Full Stack intern. My main focus these days is develop and support the international market distribution centers with web applications that help them improve their supply chain opperation's efficiency.",
    "I also recently launched this personal portfolio that I made from scratch using HTML, SASS, Vanilla JS, and Eleventy.",
    "Here are a few technologies I’ve been working with recently:"
  ],
  "aboutMeSkills": [
    "HTML",
    "SASS",
    "Javascript",
    "Typescript",
    "Eleventy",
    "Angular"
  ],
  "experience": [
    {
      "companyName": "Walmart",
      "title": "Full Stack",
      "startDate": "2021-07-12",
      "endDate": null,
      "responsabilities": [
        "Working within International Supply Chain Fulfillment in Digital Transformation, maintaining SCPACE, an application that helps distribution center managers monitor operations and associate efficiency",
        "Successfully convey technical concepts to non-technical users and identify customer needs to communicate to developers",
        "Mentored two high school interns into developing chatbot PoC",
        "Designed, developed, and deployed chatbot system, publishing UI as npm package for reusability and developing backend using Flask framework (Python)",
        "Improved incident management by creating incident visualization",
        "Authenticated and connected 3rd party API in Spring Boot to develop incident API and display it into the Angular front end"
      ]
    },
    {
      "companyName": "ExxonMobil",
      "title": "Full Stack Intern",
      "startDate": "2020-08-12",
      "endDate": "2020-05-12",
      "responsabilities": [
        "Completed PoC to MVP transition making web app scalable and production-ready",
        "Automated infrastructure of a React.js web app with Terraform",
        "Efficiently worked as a Scrum team using Azure DevOps for versioning control, project management, and CI/CD",
        "Increased app maintainability by adding performance management",
        "Increased Azure Functions reliability by migrating it from JS to TS",
        "Hardened authentication and authorization by replacing 3rd party libraries with Azure Active Directory and User Groups",
        "Lowered replication cost by redesigning the entire database using Azure Table Storage"
      ]
    },
    {
      "companyName": "ExxonMobil",
      "title": "Admin Analyst",
      "startDate": "2019-08-12",
      "endDate": "2019-05-12",
      "responsabilities": [
        "Combined previous data visualizations into one automated and manageable web dashboard with Flask",
        "Automated software delivery process by setting up CI/CD pipeline in OpenShift Container Platform",
        "Worked in an Agile development cycle using Scrum methodologies"
      ]
    }
  ],
  "work": [
    {
      "title": "Gifterest",
      "featuredProject": true,
      "description": "A cross-platform mobile application that reminds the user of friend’s important events and generates gift recomendations for each friend based on their interests. It will be available for both iOS and Android",
      "stack": [
        "Flutter",
        "Firebase",
        "Figma"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/gifterest",
        "self": "https://ppjosue14.wixsite.com/abraham/bonobo"
      },
      "imgUrl": "/assets/img/launcher_iconlogo_circle 1.png"

    },
    {
      "title": "Personal Portfolio",
      "featuredProject": true,
      "description": "I developed my personal portfolio you're looking at right now from start to finish! With the design inspiration of Brittany Chiang, I developed the website using HTML, SCSS, Vanilla JS, and Eleventy.",
      "stack": [
        "HTML",
        "SCSS",
        "Javascript",
        "NJK",
        "11ty"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/static-portfolio",
        "self": "/"
      },
      "imgUrl": "/assets/img/squared_my-logo.png"

    },
    {
      "title": "Time Tracker App",
      "featuredProject": false,
      "description": "Time Tracker is a cross-platform mobile application that helps to keep track of time and salary earned per job.",
      "stack": [
        "Flutter",
        "Firebase"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/time_tracker",
        "self": "https://ppjosue14.wixsite.com/abraham/timetracker"
      }
    },
    {
      "title": "Qdash",
      "featuredProject": false,
      "description": "During my ExxonMobil IT internship, I developed a serverless application on Azure for refineries. This application launched into 8 refineries globally.",
      "stack": [
        "React.js",
        "Azure",
        "Terraform"
      ],
      "links": {
        "git": "",
        "self": "https://ppjosue14.wixsite.com/abraham/qdash"
      }
    },
    {
      "title": "MusikColab",
      "featuredProject": false,
      "description": "This was my internet programming project where I learned Back-End and Front-End with Express.js, JavaScript, HTML, and CSS",
      "stack": [
        "Node.js",
        "HTML",
        "JS",
        "SQLite"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/musikcolab",
        "self": "https://ppjosue14.wixsite.com/abraham/musikcolab"
      }
    }
  ],
  "getInTouchText": "Currently I'm looking for a remote job opportunity, so please contact me if you want me to help your team. Otherwise, if you just have a question or want to say hi, my inbox is always open.",
  "git": "https://github.com/Aperezpe",
  "portfolioRepoUrl": "https://github.com/Aperezpe/static-portfolio",
  "resumeUrl": "https://drive.google.com/file/d/1F9ofe8iJi7yOJn8dkmj09AvBu0SsS2DM/view",
  "linkedIn": "https://www.linkedin.com/in/aperezpe/",
  "email": "aperezpe01@gmail.com"

}