{
  "name": "Abraham Perez",
  "introText": "I specialize on web and mobile development. I'm actively looking for a job opportunity as Front-end or Full-stack developer!",
  "aboutMeText": [
    "Hello! My name is Abraham and I enjoy creating things that live on the internet. My interest in web development started back in 2018 when I was exposed to basic concepts of Web Development such as jQuery, HTML, and CSS on my Internet Programming class. I was amazed to know that I can create any interface only using a computer!",
    "Fast-forward to today, and I’ve had the privilege of having two internships at ExxonMobil, one as an Admin Analyst and the other one as Full Stack intern. My main focus these days is develop and support the international market distribution centers with web applications that help them improve their supply chain opperation's efficiency.",
    "I also recently launched this personal portfolio that I made from scratch using HTML, SASS, Vanilla JS, and Eleventy.",
    "Here are a few technologies I’ve been working with recently:"
  ],
  "aboutMeSkills": [
    "React",
    "React Native",
    "Typescript",
    "Android Native",
    "HTML & CSS",
    "SQL \\ No SQL",
    "Flutter"
  ],
  "experience": [
    {
      "companyName": "Walmart",
      "title": "Full Stack",
      "startDate": "2021-07-12",
      "endDate": null,
      "responsabilities": [
        "Led a team of 4 frontend engineers in supporting the international Warehouse Management System (WMS)",
        "Oversaw developers in a multi-flavor micro-services system, ensuring high code quality and adherence to configuration management for reliable app releases",
        "Leveraged React & Android Native expertise to train teammates, boosting code delivery speed by 30%",
        "Reduced tech-debt by 25% through proactive refactoring and upgrading dependencies and CI/CDs",
        "Collaborated with cross-functional teams in designing and grooming user stories"
      ]
    },
    {
      "companyName": "ExxonMobil",
      "title": "Full Stack Intern",
      "startDate": "2020-05-12",
      "endDate": "2020-08-12",
      "responsabilities": [
        "Developed a serverless application on Azure for refineries. This application launched into 8 refineries globally",
        "Automated infrastructure of React.js app with Terraform",
        "Efficiently worked as a Scrum team using Azure DevOps for versioning control, project management, and CI/CD",
        "Hardened app by migrating current authentication to a role-based authentication",
        "Lowered replication cost by redesigning the entire database using Azure Table Storage"
      ]
    },
    {
      "companyName": "ExxonMobil",
      "title": "Admin Analyst",
      "startDate": "2019-05-12",
      "endDate": "2019-08-12",
      "responsabilities": [
        "Combined previous data visualizations into one automated and manageable web dashboard with Flask",
        "Automated software delivery process by setting up CI/CD pipeline in OpenShift Container Platform",
        "Worked in an Agile development cycle using Scrum methodologies"
      ]
    }
  ],
  "work": [
    {
      "title": "Flex Job Reports",
      "featuredProject": true,
      "description": "App for HVAC companies to streamline job reporting with dynamic forms, smart AI summaries, email reports, and a user-friendly UI. Coming soon to the App Store.",
      "stack": [
        "React-Native",
        "Supabase",
        "Gen-AI",
        "Figma"
      ],
      "links": {
        "appleStore": "https://in-progress.dummy.com",
        "git": "https://github.com/Aperezpe/flex-job-reports-mobile",
        "self": "https://github.com/Aperezpe/flex-job-reports-mobile"
      },
      "showSelfLink": false,
      "imgUrl": "/assets/img/flex-job-reports-img.png"

    },
    {
      "title": "Gifterest",
      "featuredProject": true,
      "description": "A cross-platform mobile application that I developed on my free time. It reminds of friend’s important events and generates gift recomendations for each friend based on their interests. You can find it in the Appstore and Google Play!",
      "stack": [
        "Flutter",
        "Firebase",
        "Figma"
      ],
      "links": {
        "appleStore": "https://discontinued",
        "googlePlay": "https://discontinued",
        "git": "https://github.com/Aperezpe/gifterest",
        "self": "https://github.com/Aperezpe/gifterest"
      },
      "showSelfLink": false,
      "imgUrl": "/assets/img/launcher_iconlogo_circle 1.png"

    },
    {
      "title": "Personal Portfolio",
      "featuredProject": true,
      "description": "With the design inspiration of Brittany Chiang, I developed this personal portfolio from the ground up by using classic HTML, SCSS, Vanilla JS, and Eleventy.",
      "stack": [
        "HTML",
        "SCSS",
        "Javascript",
        "NJK",
        "11ty"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/static-portfolio",
        "self": "/"
      },
      "imgUrl": "/assets/img/squared_my-logo.png"

    },
    {
      "title": "Qdash",
      "featuredProject": false,
      "description": "During my ExxonMobil IT internship, I developed a serverless application on Azure for refineries. This application launched into 8 refineries globally.",
      "stack": [
        "React.js",
        "Azure",
        "Terraform"
      ],
      "links": {
        "self": "https://q.exxonmobil.com/"
      }
    },
    {
      "title": "IP Address Tracker",
      "featuredProject": false,
      "description": "Developed an IP address tracker with Next.js for FrontendMentor challenge. Consumed third-party APIs to get IP address data and generate maps",
      "stack": [
        "Next.js",
        "Tailwind",
        "Typescript"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/ip-address-tracker",
        "self": "https://ip-address-tracker-gray-psi.vercel.app/"
      }
    },
    {
      "title": "Fancy Tic Tac Toe",
      "featuredProject": false,
      "description": "Developed a nice looking Tic Tac Toe UI and coded the entire business logic using my own solution",
      "stack": [
        "React.js",
        "SCSS",
        "Typescript"
      ],
      "links": {
        "git": "https://github.com/Aperezpe/tic-tac-toe",
        "self": "https://main--resplendent-tulumba-f52091.netlify.app/"
      }
    },
    {
      "title": "Maze Generator & Solver",
      "featuredProject": false,
      "description": "Interactive maze app that generates mazes and solves them with pathfinding logic.",
      "stack": [
        "Javascript",
        "Algorithms",
        "Vercel"
      ],
      "links": {
        "self": "https://maze-game-calude-db4ns5sph-aperezpes-projects.vercel.app/"
      }
    }
    
  ],
  "getInTouchText": "Currently I'm actively looking for a remote Frontend opportunity, so please contact me if you think I can fit in your team! Otherwise, if you just feel like saying hi, my inbox is always open! (:",
  "git": "https://github.com/Aperezpe",
  "portfolioRepoUrl": "https://github.com/Aperezpe/static-portfolio",
  "resumeUrl": "https://drive.google.com/file/d/1F9ofe8iJi7yOJn8dkmj09AvBu0SsS2DM/view",
  "linkedIn": "https://www.linkedin.com/in/aperezpe/",
  "email": "aperezpe01@gmail.com"

}
